/**
 * Created by user on 3/7/16.
 */
package tutorial {
public class TutorialTexts {
    private var _objText:Object;

    public function TutorialTexts() {
        _objText = {};
        _objText['next'] = 'Продолжить';
        _objText['ok'] = 'Далее';
        _objText['lookAround'] = 'На полный экран';

        _objText[1] = {};
        _objText[1][1] = 'У каждой мастерицы среди игольниц, клубков ниток и пряжи есть небольшая коробочка, в которой хранятся маленькие кусочки разнообразной ткани, цветные нитки и прочие вещи, которые могут пригодиться в рукоделии.';
        _objText[1][2] = 'В одной из таких коробочек, которую никто давно не открывал и не наводил порядок, долгое время хранились такие вещи. Внутри коробки нитки и лоскутки крепко спутались в большой яркий клубок,';
        _objText[1][3] = 'распутать его можно только с помощью волшебства! И это волшебство случилось! Таинственным образом в этой коробке появился яркий мир, где все жители вязаные, и все вокруг состоит из мягкой ткани и ниток.';
        _objText[1][4] = 'Но, не каждый может попасть в эту чудную долину. Только тем, кто верит в чудеса и любит заниматься рукоделием откроется этот мягкий мир! Давай скорее заглянем в эту загадочную коробочку!';

        _objText[2] = {};
        _objText[2][0] = 'Привет! Меня зовут Клубочек и мы в "Долине Рукоделия"! Следуй за мной и я покажу, как здесь все устроено!';
        _objText[2][1] = 'Для удобства можешь перейти в полноэкранный режим.';

        _objText[3] = {};
        _objText[3][1] = 'Посмотри сюда! Здесь у нас пшеница! Самое время собрать ее';

        _objText[4] = {};
        _objText[4][0] = 'Пшеница всегда пригодится, засеем грядки и пополним запасы!';
        _objText[4][5] = 'Сажаем одну - через время получаем две!';

        _objText[5] = {};
        _objText[5][1] = 'А тут у нас курочки - они высиживают яйца, но сперва их нужно покормить!';
        _objText[5][3] = 'Отлично! Чтобы курочка неслась быстрее, нажми на нее и выбери “ускорить”';
        _objText[5][6] = 'Вот какое большое яйцо! Отнесем его  на склад!';

        _objText[6] = {};
        _objText[6][0] = 'Поздравляю, у тебя хорошо получается! Впереди тебя ждет еще много интересного!';

        _objText[7] = {};
        _objText[7][0] = 'Вижу, тебе понравилось ухаживать за животными! Тогда давай купим еще одну птичку!';
        _objText[7][5] = 'Все приобретенные животные появляются в питомниках.';

        _objText[8] = {};
        _objText[8][0] = 'Наши курочки нуждаются в хорошем питании. Построим Кормилку, где и будем производить еду для животных!';
        _objText[8][5] = 'Откроем здание!';

        _objText[9] = {};
        _objText[9][0] = 'Теперь можно создать немного корма!';

        _objText[10] = {};
        _objText[10][1] = 'Отлично, давай вскопаем еще несколько грядок, чтобы урожая было еще больше!';

        _objText[11] = {};
        _objText[11][1] = 'У нас уже есть семена кукурузы, давай засеем ими новые грядки!';

        _objText[12] = {};
        _objText[12][1] = 'На хорошие продукты и покупатель найдется! Не будем ждать, откроем лавку!';
        _objText[12][2] = 'Ура! А вот и первый посетитель! Посмотрим, что ему нужно!';
        _objText[12][8] = 'Здравствуйте! Хочу купить несколько яиц.';
        _objText[12][9] = 'Большое спасибо! Пойду всем о вас расскажу!';

        _objText[13] = {};
        _objText[13][0] = 'Молодец, теперь о нас все узнают и от покупателей отбоя не будет! А пока построим Булочную, чтобы радовать клиентов еще и ароматными булочками!';

        _objText[14] = {};
        _objText[14][1] = 'Нажми на здание и выбери “ускорить”, чтобы оно быстрее построилось!';

        _objText[15] = {};
        _objText[15][0] = 'Перережем ленточку!';

        _objText[16] = {};
        _objText[16][1] = 'Ух ты! Какая Булочная! Пошли на огород, соберем немного пшеницы для булочки!';

        _objText[17] = {};
        _objText[17][1] = 'Пшеница собрана! Печка растоплена! Приступаем к выпеканию!';

        _objText[18] = {};
        _objText[18][0] = 'Не будем ждать! Нажми “ускорить” и булочка испечется мгновенно!';

        _objText[19] = {};
        _objText[19][0] = 'Готовую продукцию отправим на склад.';

        _objText[20] = {};
        _objText[20][0] = 'С такими темпами нам скоро пригодятся еще рабочие. Возьмем себе помощника прямо сейчас!';

        _objText[21] = {};
        _objText[21][0] = 'Думаю, нет равнодушных к сладенькому - Пасека как раз  отличное приобретение!';

        _objText[22] = {};
        _objText[22][1] = 'Не забудь поставить Улей!';

        _objText[23] = {};
        _objText[23][0] = 'Какое умиротворенное жужжание! Накорми пчел свежим клевером и получишь много вкусного меда!';

        _objText[24] = {};
        _objText[24][0] = 'Пока производство идет полным ходом, пойдем в гости к соседу.';
        _objText[24][3] = 'Симпатичненько здесь! А у тебя будет еще лучше! Давай посмотрим, что тут полезного можно прикупить!';
        _objText[24][6] = 'Инструмент нам точно пригодится. Нажми чтобы приобрести.';
        _objText[24][7] = 'На рынке у друзей можно купить много чего интересного.';
        _objText[24][8] = 'В гостях хорошо - а дома лучше!';

        _objText[25] = {};
        _objText[25][0] = 'Молодец! Теперь и ты частичка нашего мира, где каждая петелька и стежок сделаны с любовью!';

        _objText[26] = {};
        _objText[26][1] = 'А, чуть не забыл. Вот тебе небольшая награда!';
    }

    public function get objText():Object { return _objText }
}
}
