/**
 * Created by user on 3/7/16.
 */
package tutorial {
public class TutorialTexts {
    private var _objText:Object;

    public function TutorialTexts() {
        _objText = {};
        _objText['next'] = 'Продолжить';
        _objText['ok'] = 'Далее';
        _objText['lookAround'] = 'На полный экран';

        _objText[1] = {};
        _objText[1][0] = 'Ну спасибо! Мы жители лоскутного мира! Закройте коробку! Нас и так мало осталось! А с вашей помощью вообще повымираем!';
        _objText[1][1] = 'Давай осмотримся, поищем телочек';

        _objText[2] = {};
        _objText[2][1] = 'А местечко неплохое. Пщеница прямо на глазах выросла, и на руках тоже. Можно собирать уже!';

        _objText[3] = {};
        _objText[3][0] = 'Пшеница всегда пригодится. Засеем грядки и пополним запасы! Будем крыс приманывать';
        _objText[3][5] = 'Сажай одну пшеницу - а через время получишь таки 2!';

        _objText[4] = {};
        _objText[4][1] = 'Снова куры все сожрали! Покорми их!';
        _objText[4][3] = 'Чтобы курочка быстрее оплодилась - нажми на неё и выбери Узбагоить';
        _objText[4][6] = 'Поразкидал тут яйца - подбери давай!';

        _objText[5] = {};
        _objText[5][0] = 'Поздравляем! Ты получил новый уровень! Но все равно еще нуб..';

        _objText[6] = {};
        _objText[6][0] = 'В нашем курятнике будет место еще для нескольких ципочек.';
        _objText[6][5] = 'Все куры попадают не в коровник, а в курятник!';

        _objText[7] = {};
        _objText[7][0] = 'А теперь давай построим Дробилку, где производится корм для нашых красавиц';
        _objText[7][5] = 'Разрежь ленту, открой заведение!';

        _objText[8] = {};
        _objText[8][0] = 'Теперь можем произвести дифосфат кальция в промышленных масштабах!';

        _objText[9] = {};
        _objText[9][1] = 'Давай еще где-нибудь разбросаем чернозем';
        _objText[9][5] = 'Выбери место, где спать будешь';

        _objText[10] = {};
        _objText[10][1] = 'Э, сышь, давай еще что-нибудь посадим? Эти, пупыришки желтые, как их там..';

        _objText[11] = {};
        _objText[11][1] = 'Пошли посмотрим, че там у Семеныча в холодильнике стучит';
        _objText[11][2] = 'Ты смотри, еще кто-то мчится на халявную жратву';
        _objText[11][8] = 'Поздравляю с открытием! Надо мной хозяин поизгалялся, хоть куриные будут';
        _objText[11][9] = 'Спасибо большое! Теперь будет что делать перед сном!';

        _objText[12] = {};
        _objText[12][0] = 'Теперь можно построить Пекарню и торговать чебукрысами!';

        _objText[13] = {};
        _objText[13][1] = 'Нажми на здание и выбери Ускорить, чтобы Флеш стал еще быстрее';

        _objText[14] = {};
        _objText[14][0] = 'Давай уже открывай быстрее, жрать то охота';

        _objText[15] = {};
        _objText[15][1] = 'Да соберем же мы продукты для чебукрысов!';

        _objText[16] = {};
        _objText[16][1] = 'Шедеврально справились! Теперь сделаем булочко';

        _objText[17] = {};
        _objText[17][0] = 'Оплати лайк и получи булку бесплатно!';

        _objText[18] = {};
        _objText[18][0] = 'Готовые финдиклюшки отправляй на склад, а то у складского и так почти уже пузо пропало';

        _objText[19] = {};
        _objText[19][0] = 'Что-то мне надоело пахать, давай раба себе возьмем';

        _objText[20] = {};
        _objText[20][0] = 'А теперь можно и фазенду для перипончастокрылых соорудить!';

        _objText[21] = {};
        _objText[21][1] = 'Сюда бы еще пару сарайчиков для окоянных';

        _objText[22] = {};
        _objText[22][0] = 'Запомни: пчелы жрут клевер! O_O А теперь корми их!';

        _objText[23] = {};
        _objText[23][0] = 'Слышь, у и тебя будет пару копочек? А? Нету? Ну тогда пошли к Соседу, он с тобой побеседует';
        _objText[23][3] = 'Видишь, как красиво? А всего-то полгода как местный депутат! Пошли кое-что покажу';
        _objText[23][6] = 'О, инструментик! Греби его, пока никто не видит';
        _objText[23][7] = 'На рынках всегда что-то лежит криво, потому порой наглядывай туда';
        _objText[23][8] = 'Тебе в гостях рады конечно, но лучше идика домой';

        _objText[24] = {};
        _objText[24][0] = 'Красава! Теперь все сам, а я пойду в Танки играть. Пока';

        _objText[25] = {};
        _objText[25][1] = 'А, чуть не забыл. Вот тебе небольшая награда!';
    }

    public function get objText():Object { return _objText }
}
}
